Labo4/Prenoms/app/controllers/prenoms_controller.rb

  def index
    @prenoms = Prenom.all
---
SELECT `prenoms`.* FROM `prenoms`

  def create
    @prenom = Prenom.new(prenom_params)

    respond_to do |format|
      if @prenom.save
---
INSERT INTO `prenoms` (`texte`, `created_at`, `updated_at`) VALUES ('aaaa', '2016-04-19 13:50:02', '2016-04-19 13:50:02')

  def destroy
    @prenom.destroy
---
DELETE FROM `prenoms` WHERE `prenoms`.`id` = 20

    def set_prenom
      @prenom = Prenom.find(params[:id])
---
SELECT  `prenoms`.* FROM `prenoms` WHERE `prenoms`.`id` = 20 LIMIT 1